Revit 2027 API
FamilySymbol.HasThermalProperties Method
 Identifies if this FamilySymbol can include thermal properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasThermalProperties()
Public Function HasThermalProperties As Boolean
public:
bool HasThermalProperties()
member HasThermalProperties : unit -> bool
Return Value
Boolean
 True if the FamilySymbol can include thermal properties, false otherwise.
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace